Masmiseim36/nxpSDK/devices/MIMXRT798S/iar/startup_MIMXRT798S_cm33_core1.s
        PUBWEAK GPIO80_IRQHandler
        PUBWEAK GPIO80_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO80_IRQHandler
        LDR     R0, =GPIO80_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO81_IRQHandler
        PUBWEAK GPIO81_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO81_IRQHandler
        LDR     R0, =GPIO81_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO90_IRQHandler
        PUBWEAK GPIO90_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO90_IRQHandler
        LDR     R0, =GPIO90_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO91_IRQHandler
        PUBWEAK GPIO91_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO91_IRQHandler
        LDR     R0, =GPIO91_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO100_IRQHandler
        PUBWEAK GPIO100_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO100_IRQHandler
        LDR     R0, =GPIO100_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO101_IRQHandler
        PUBWEAK GPIO101_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO101_IRQHandler
        LDR     R0, =GPIO101_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved83_IRQHandler
        PUBWEAK Reserved83_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved83_IRQHandler
        LDR     R0, =Reserved83_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved84_IRQHandler
        PUBWEAK Reserved84_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved84_IRQHandler
        LDR     R0, =Reserved84_DriverIRQHandler
        BX      R0

        PUBWEAK PIN_INT0_IRQHandler
        PUBWEAK PIN_INT0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PIN_INT0_IRQHandler
        LDR     R0, =PIN_INT0_DriverIRQHandler
        BX      R0

        PUBWEAK PIN_INT1_IRQHandler
        PUBWEAK PIN_INT1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PIN_INT1_IRQHandler
        LDR     R0, =PIN_INT1_DriverIRQHandler
        BX      R0

        PUBWEAK PIN_INT2_IRQHandler
        PUBWEAK PIN_INT2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PIN_INT2_IRQHandler
        LDR     R0, =PIN_INT2_DriverIRQHandler
        BX      R0

        PUBWEAK PIN_INT3_IRQHandler
        PUBWEAK PIN_INT3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PIN_INT3_IRQHandler
        LDR     R0, =PIN_INT3_DriverIRQHandler
        BX      R0

        PUBWEAK SAI3_IRQHandler
        PUBWEAK SAI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI3_IRQHandler
        LDR     R0, =SAI3_DriverIRQHandler
        BX      R0

        PUBWEAK XSPI2_IRQHandler
        PUBWEAK XSPI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
XSPI2_IRQHandler
        LDR     R0, =XSPI2_DriverIRQHandler
        BX      R0

        PUBWEAK MMU2_IRQHandler
        PUBWEAK MMU2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MMU2_IRQHandler
        LDR     R0, =MMU2_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved92_IRQHandler
        PUBWEAK Reserved92_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved92_IRQHandler
        LDR     R0, =Reserved92_DriverIRQHandler
        BX      R0

        PUBWEAK GDET3_IRQHandler
        PUBWEAK GDET3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GDET3_IRQHandler
        LDR     R0, =GDET3_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG3_IRQHandler
        PUBWEAK CDOG3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG3_IRQHandler
        LDR     R0, =CDOG3_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG4_IRQHandler
        PUBWEAK CDOG4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG4_IRQHandler
        LDR     R0, =CDOG4_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved96_IRQHandler
        PUBWEAK Reserved96_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved96_IRQHandler
        LDR     R0, =Reserved96_DriverIRQHandler
        BX      R0

        PUBWEAK CPU1_IRQHandler
        PUBWEAK CPU1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CPU1_IRQHandler
        LDR     R0, =CPU1_DriverIRQHandler
        BX      R0

        PUBWEAK JPEGDEC_IRQHandler
        PUBWEAK JPEGDEC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
JPEGDEC_IRQHandler
        LDR     R0, =JPEGDEC_DriverIRQHandler
        BX      R0

        PUBWEAK PNGDEC_IRQHandler
        PUBWEAK PNGDEC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PNGDEC_IRQHandler
        LDR     R0, =PNGDEC_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved100_IRQHandler
        PUBWEAK Reserved100_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved100_IRQHandler
        LDR     R0, =Reserved100_DriverIRQHandler
        BX      R0

        PUBWEAK TEMPDET0_IRQHandler
        PUBWEAK TEMPDET0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TEMPDET0_IRQHandler
        LDR     R0, =TEMPDET0_DriverIRQHandler
        BX      R0

        PUBWEAK TEMPDET1_IRQHandler
        PUBWEAK TEMPDET1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TEMPDET1_IRQHandler
        LDR     R0, =TEMPDET1_DriverIRQHandler
        BX      R0

        PUBWEAK EZHV_IRQHandler
        PUBWEAK EZHV_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EZHV_IRQHandler
        LDR     R0, =EZHV_DriverIRQHandler
        BX      R0

        PUBWEAK SLEEPCON1_IRQHandler
        PUBWEAK SLEEPCON1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SLEEPCON1_IRQHandler
        LDR     R0, =SLEEPCON1_DriverIRQHandler
        BX      R0

        PUBWEAK PVTS1_CPU1_IRQHandler
        PUBWEAK PVTS1_CPU1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PVTS1_CPU1_IRQHandler
        LDR     R0, =PVTS1_CPU1_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved106_IRQHandler
        PUBWEAK Reserved106_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved106_IRQHandler
        LDR     R0, =Reserved106_DriverIRQHandler
        BX      R0

        PUBWEAK PVTS1_HIFI1_IRQHandler
        PUBWEAK PVTS1_HIFI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PVTS1_HIFI1_IRQHandler
        LDR     R0, =PVTS1_HIFI1_DriverIRQHandler
        BX      R0

